//
//  ErrorMessage.swift
//  Agent
//
//  Created by 于劲 on 2017/11/16.
//  Copyright © 2017年 xianlai. All rights reserved.
//

import Foundation
class ErrorMessage: NSObject {
    var msg = Dictionary<Int, String>()
    override init() {
        msg = [:]
        msg[15001] = "用户名密码错误"
        msg[15002] = "验证码错误"
        msg[15004] = "token失效，请重新登录。"
        msg[15003] = "手机号不存在"
        msg[15005] = "短信发送次数超限，请明天再来。"
        msg[15006] = "输出密码错误次数超出限制，请使用手机号验证码登录。"
        
        msg[14001]="超时"
        msg[140002]="获取参数信息失败"
        msg[14003]="用户不存在"
        msg[14004]="未知错误"
        msg[14005]="未绑定区服"
        msg[14006]="非法的转卡数量"
        msg[14007]="下级代理不存在"
        msg[14008]="下级代理已被禁用"
        msg[14009]="下级代理所在区服错误"
        msg[140010]="转卡数量不能大于当前库存数量"
        msg[14011]="没有权限进行此操作"
        msg[14012]="停服中，请稍后购买！"
        msg[14013]="查询服务器状态异常，请稍后购买！"
        msg[14014]="当前帐号已经被冻结,无法给玩家充卡,请联系客服。"
        msg[14015]="您的账号充卡异常，为了确保账号安全，系统自动冻结，有问题请联系官方客服。"
        msg[14016]="您还未绑定手机,请先绑定!"
        msg[14017]="重复提交数据,请稍后再试!"
        msg[14018]="设置转卡预警次数发送邮件!"
        msg[14019]="设置转卡预警次数自动冻结!"
        msg[14020]="每分钟转卡次数超限!"
        msg[14021]="每小时转卡次数超限!"
        msg[14022]="每天转卡次数超限!"
        msg[14023]="单次转卡张数与库存超限!"
        msg[14024]="更新转卡累计次数失败!"
        msg[14025]="更新可配时间累计张数失败!"
        msg[14026]="设置自动冻结!"
        msg[14027]="代理商房卡不足!"
        msg[14028]="暂无数据!"
        msg[14029]="非法的玩家ID"
        msg[14030]="网络不通"
        msg[14031]="连接被拒绝"
        msg[14032]="网络异常"
        msg[14033]="请输入玩家ID"
        msg[14034]="请输入代理ID"
        msg[14035]="请输入售卡数量"
        msg[14036]="玩家不存在"
        msg[14037]="区服不存在"
        msg[14038]="给玩家转卡失败"

        msg[12000]="商品不存在"
        msg[12001]="商品不可用"
        msg[12002]="商品已下架"
        msg[12003]="商品已过期"
        msg[12004]="超过活动购买次数限制"
        msg[12005]="抱歉，当前商品您尚有一笔未支付的订单"
        msg[12006]="支付失败，请稍后重试"
        msg[12007]="购卡失败，请稍后重试"
        msg[12010]="抱歉，该订单状态变化，无法继续支付"
        msg[12011]="抱歉，活动已过期，请重新下单"
        
        msg[11600]="手机号不能为空"
        
        msg[503]="服务器开小差了，稍后再试吧"
        msg[99]="此功能暂未开放"
        msg[500]="无法连接至网络"
    }
    
    func desc(key:Int) -> (String) {
        if (msg[key] != nil) {
            return msg[key]!
        } else {
            return "未知错误"
        }
    }
}

let errMsg = ErrorMessage()
